_posts/2019-08-07-BUSCO-gene-descriptions.html
---
layout: post
class: post-template
title: "Get BUSCO gene descriptions from OrthoDB"
author: thackl
cover: img/mojave.jpg
categories: [genomics]
---


<p>
<a href="https://busco.ezlab.org/">BUSCO</a> lacks descriptions of the ortholog groups it searches for. You can query
<a href="https://www.orthodb.org/">OrthoDB</a> via its API to map BUSCO IDs and pull the information. Below is a short
R snippet to automate this and produce a nice table.
</p>

<p>
<a href="https://busco.ezlab.org/">BUSCO</a> is a great tool to assess the completeness of eukaryotic genome
assemblies. It let's you search your assemblies for a sets of conserved
near-universal single copy orthologs genes, and returns useful statistics on
their absence and presence in the data set at hand. Because the chosen orthologs
are ubiquitous, complete assemblies should contain most of these markers. It also
is a good way for comparing assembly versions - the more complete markers, the
better. But also the numbers of fragmented and duplicated markers can give you
useful information about assembly qualities.
</p>

<p>
Recently, I used BUSCO to assess four assemblies of quite similar strains of
the marine flagellate <i>Cafeteria roenbergensis</i>. Among other things, I noticed
that in all strain the same set of BUSCOs was missing. This made me curious, and
I wondered if this might reflect some interesting biology - certain pathways
missing, &#x2026; Unfortunately, the output generated by BUSCO does not contain any
descriptive information about the different gene clusters, just the BUSCO IDs
for each cluster; apparently a issue that others encountered before, and could
not really solve (<a href="https://www.biostars.org/p/182544/">Get BUSCO gene descriptions - Biostars</a>).
</p>

<p>
So, here is how I solved it. Most BUSCO data sets are generated from <a href="https://www.orthodb.org/">OrthoDB</a>. If
you search OrthoDB with BUSCO IDs, you will immediately be forwarded to the
respective ortho-group entry containing all the metainformation we are
interested in. Because I want to retrieve metadata for a large number of BUSCO
IDs, I wrote a small R script that queries the OrthoDB API, and returns a nice
table with the results.
</p>

<div class="org-src-container">

<pre class="src src-R"><span style="color: #a2cd5a;">library</span>(tidyverse)
<span style="color: #a2cd5a;">library</span>(jsonlite)

busco_ids <span style="color: #a2cd5a;">&lt;-</span> c(<span style="color: #deb887;">"EOG093714Q2"</span>, <span style="color: #deb887;">"EOG09370GHP"</span>, <span style="color: #deb887;">"EOG09370OS5"</span>)
names(busco_ids) <span style="color: #a2cd5a;">&lt;-</span> busco_ids <span style="color: #7f7f7f;"># </span><span style="color: #7f7f7f;">so map_df gets .id right</span>

<span style="color: #7f7f7f;"># </span><span style="color: #7f7f7f;">a tibble of interpro profile associated with each busco_id</span>
busco_ipr <span style="color: #a2cd5a;">&lt;-</span> map_df(busco_ids, .id=<span style="color: #deb887;">"busco_id"</span>,  <span style="color: #8f62a6;">function</span>(busco_id){
  write(busco_id, stderr()) <span style="color: #7f7f7f;"># </span><span style="color: #7f7f7f;">just so we can monitor progress</span>
  <span style="color: #7f7f7f;"># </span><span style="color: #7f7f7f;">map the BUSCO ID to OrthoDB group ID</span>
  query <span style="color: #a2cd5a;">&lt;-</span> read_json(paste0(<span style="color: #deb887;">"https://www.orthodb.org/search?query="</span>, busco_id))
  odb_id <span style="color: #a2cd5a;">&lt;-</span> query$data[1]
  <span style="color: #7f7f7f;"># </span><span style="color: #7f7f7f;">get all info on the orthogroup</span>
  odb_info <span style="color: #a2cd5a;">&lt;-</span> read_json(paste0(<span style="color: #deb887;">"https://www.orthodb.org/group?id="</span>, odb_id),
    simplifyVector = <span style="color: #98f5ff;">TRUE</span>)
  <span style="color: #7f7f7f;"># </span><span style="color: #7f7f7f;">return the interpro table</span>
  odb_info$data$interpro_domains
})

busco_ipr %&gt;% select(busco_id, description)
</pre>
</div>
<p>
And this is how the table looks like:
</p>
<pre class="example">
     busco_id                                              description
1 EOG093714Q2                          Mediator complex, subunit Med31
2 EOG093714Q2       Mediator complex, subunit Med31 domain superfamily
3 EOG09370GHP                       Reduced growth phenotype protein 1
4 EOG09370OS5 Ribosomal protein S2, flavodoxin-like domain superfamily
5 EOG09370OS5                                     Ribosomal protein S2
6 EOG09370OS5      Ribosomal protein S2, bacteria/mitochondria/plastid
7 EOG09370OS5                     Ribosomal protein S2, conserved site
</pre>
